
## Plan Result (aat)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 18 to add, 7 to change, 18 to destroy.</code></pre>

* Update
  * azurerm_consumption_budget_resource_group.grafana-budget-alert[0]
  * module.alert-action-group.azurerm_resource_group_template_deployment.action-group
  * module.postgresql[0].azurerm_postgresql_flexible_server.pgsql_server
  * module.postgresql[0].azurerm_postgresql_flexible_server_firewall_rule.pg_firewall_rules[&#34;grafana00&#34;]
  * module.postgresql[0].azurerm_postgresql_flexible_server_firewall_rule.pg_firewall_rules[&#34;grafana01&#34;]
  * module.postgresql[0].azurerm_postgresql_flexible_server_firewall_rule.pg_firewall_rules[&#34;grafana1000&#34;]
  * module.postgresql[0].azurerm_postgresql_flexible_server_firewall_rule.pg_firewall_rules[&#34;grafana1001&#34;]
* Replace
  * azurerm_dashboard_grafana.main[0]
  * azurerm_dashboard_grafana.main_west[0]
  * azurerm_role_assignment.admin[0]
  * azurerm_role_assignment.admin-grafana9[0]
  * azurerm_role_assignment.app_insights_dcd_cnp_aat_access[0]
  * azurerm_role_assignment.app_insights_dcd_cnp_aat_access-grafana9[0]
  * azurerm_role_assignment.app_insights_dcd_cnp_prod_access[0]
  * azurerm_role_assignment.app_insights_dcd_cnp_prod_access-grafana9[0]
  * azurerm_role_assignment.editors[0]
  * azurerm_role_assignment.editors-grafana9[0]
  * azurerm_role_assignment.more_viewers[0]
  * azurerm_role_assignment.more_viewers-grafana9[0]
  * azurerm_role_assignment.platops[0]
  * azurerm_role_assignment.platops-grafana9[0]
  * azurerm_role_assignment.readers[0]
  * azurerm_role_assignment.readers-grafana9[0]
  * azurerm_role_assignment.viewers[0]
  * azurerm_role_assignment.viewers-grafana9[0]
* Move
  * azurerm_dashboard_grafana.dashboard-grafana10[0] => azurerm_dashboard_grafana.main[0]
  * azurerm_dashboard_grafana.dashboard-grafana[0] => azurerm_dashboard_grafana.main_west[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_consumption_budget_resource_group.grafana-budget-alert[0] will be updated in-place
  ~ resource "azurerm_consumption_budget_resource_group" "grafana-budget-alert" {
        id                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.Consumption/budgets/grafana-budget-alert"
        name              = "grafana-budget-alert"
        # (4 unchanged attributes hidden)

      ~ filter {
          - dimension {
              - name     = "ResourceId" -> null
              - operator = "In" -> null
              - values   = [
                  - "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.Dashboard/grafana/dtsse-grafana-aat",
                ] -> null
            }
          + dimension {
              + name     = "ResourceId"
              + operator = "In"
              + values   = (known after apply)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # azurerm_dashboard_grafana.main[0] must be replaced
  # (moved from azurerm_dashboard_grafana.dashboard-grafana10[0])
-/+ resource "azurerm_dashboard_grafana" "main" {
      ~ endpoint                               = "https://dtsse-grafana10-aat-arg8hyczfac9cbe8.suk.grafana.azure.com" -> (known after apply)
      ~ grafana_version                        = "10.4.19" -> (known after apply)
      ~ id                                     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.Dashboard/grafana/dtsse-grafana10-aat" -> (known after apply)
      ~ name                                   = "dtsse-grafana10-aat" -> "dtsse-grafana-aat" # forces replacement
      ~ outbound_ip                            = [
          - "51.145.46.198",
          - "51.143.184.223",
        ] -> (known after apply)
        tags                                   = {
            "application"         = "core"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/dtsse-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#reform-swe"
            "environment"         = "staging"
            "managedBy"           = "DTS Software Engineering"
        }
        # (9 unchanged attributes hidden)

      ~ identity {
          - identity_ids = [] -> null
          ~ principal_id = "8ba76f21-210f-46e4-8343-efb0574c53fc" -> (known after apply)
          ~ tenant_id    = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # azurerm_dashboard_grafana.main_west[0] must be replaced
  # (moved from azurerm_dashboard_grafana.dashboard-grafana[0])
-/+ resource "azurerm_dashboard_grafana" "main_west" {
      ~ endpoint                               = "https://dtsse-grafana-aat-f6avdaarczcqftge.weu.grafana.azure.com" -> (known after apply)
      ~ grafana_version                        = "10.4.19" -> (known after apply)
      ~ id                                     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.Dashboard/grafana/dtsse-grafana-aat" -> (known after apply)
      ~ name                                   = "dtsse-grafana-aat" -> "dtsse-grafana-aat-west" # forces replacement
      ~ outbound_ip                            = [
          - "52.148.220.236",
          - "20.61.85.167",
        ] -> (known after apply)
        tags                                   = {
            "application"         = "core"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/dtsse-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#reform-swe"
            "environment"         = "staging"
            "managedBy"           = "DTS Software Engineering"
        }
        # (9 unchanged attributes hidden)

      ~ identity {
          - identity_ids = [] -> null
          ~ principal_id = "bd9f34b4-4c0c-489d-a8fd-c2ed7bf29db8" -> (known after apply)
          ~ tenant_id    = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # azurerm_role_assignment.admin[0] must be replaced
-/+ resource "azurerm_role_assignment" "admin" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.Dashboard/grafana/dtsse-grafana10-aat/providers/Microsoft.Authorization/roleAssignments/98312afe-5c09-777e-c5d2-f7b55de7c3cf" -> (known after apply)
      ~ name                                   = "98312afe-5c09-777e-c5d2-f7b55de7c3cf" -> (known after apply)
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/providers/Microsoft.Authorization/roleDefinitions/22926164-76b3-42b3-bc55-97df8dab3e41" -> (known after apply)
      ~ scope                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.Dashboard/grafana/dtsse-grafana10-aat" -> (known after apply) # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # azurerm_role_assignment.admin-grafana9[0] must be replaced
-/+ resource "azurerm_role_assignment" "admin-grafana9" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.Dashboard/grafana/dtsse-grafana-aat/providers/Microsoft.Authorization/roleAssignments/903c2671-482b-530d-5b3d-c8cf08d965ad" -> (known after apply)
      ~ name                                   = "903c2671-482b-530d-5b3d-c8cf08d965ad" -> (known after apply)
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/providers/Microsoft.Authorization/roleDefinitions/22926164-76b3-42b3-bc55-97df8dab3e41" -> (known after apply)
      ~ scope                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.Dashboard/grafana/dtsse-grafana-aat" -> (known after apply) # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # azurerm_role_assignment.app_insights_dcd_cnp_aat_access[0] must be replaced
-/+ resource "azurerm_role_assignment" "app_insights_dcd_cnp_aat_access" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/providers/Microsoft.Authorization/roleAssignments/c191b747-8daf-0673-4de2-9781057747f6" -> (known after apply)
      ~ name                                   = "c191b747-8daf-0673-4de2-9781057747f6" -> (known after apply)
      ~ principal_id                           = "8ba76f21-210f-46e4-8343-efb0574c53fc" -> (known after apply) # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/providers/Microsoft.Authorization/roleDefinitions/acdd72a7-3385-48ef-bd42-f606fba81ae7" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # azurerm_role_assignment.app_insights_dcd_cnp_aat_access-grafana9[0] must be replaced
-/+ resource "azurerm_role_assignment" "app_insights_dcd_cnp_aat_access-grafana9" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/providers/Microsoft.Authorization/roleAssignments/0c60b691-80a5-421f-391c-9ee837662bcd" -> (known after apply)
      ~ name                                   = "0c60b691-80a5-421f-391c-9ee837662bcd" -> (known after apply)
      ~ principal_id                           = "bd9f34b4-4c0c-489d-a8fd-c2ed7bf29db8" -> (known after apply) # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/providers/Microsoft.Authorization/roleDefinitions/acdd72a7-3385-48ef-bd42-f606fba81ae7" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # azurerm_role_assignment.app_insights_dcd_cnp_prod_access[0] must be replaced
-/+ resource "azurerm_role_assignment" "app_insights_dcd_cnp_prod_access" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleAssignments/55c577d5-c413-ee16-9eda-e32546fe47d9" -> (known after apply)
      ~ name                                   = "55c577d5-c413-ee16-9eda-e32546fe47d9" -> (known after apply)
      ~ principal_id                           = "8ba76f21-210f-46e4-8343-efb0574c53fc" -> (known after apply) # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/acdd72a7-3385-48ef-bd42-f606fba81ae7" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # azurerm_role_assignment.app_insights_dcd_cnp_prod_access-grafana9[0] must be replaced
-/+ resource "azurerm_role_assignment" "app_insights_dcd_cnp_prod_access-grafana9" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleAssignments/faa08be9-d90f-00c4-1867-771fa28059d5" -> (known after apply)
      ~ name                                   = "faa08be9-d90f-00c4-1867-771fa28059d5" -> (known after apply)
      ~ principal_id                           = "bd9f34b4-4c0c-489d-a8fd-c2ed7bf29db8" -> (known after apply) # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/acdd72a7-3385-48ef-bd42-f606fba81ae7" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # azurerm_role_assignment.editors[0] must be replaced
-/+ resource "azurerm_role_assignment" "editors" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.Dashboard/grafana/dtsse-grafana10-aat/providers/Microsoft.Authorization/roleAssignments/fcb792a0-cb3f-930f-432b-521652c1bab9" -> (known after apply)
      ~ name                                   = "fcb792a0-cb3f-930f-432b-521652c1bab9" -> (known after apply)
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/providers/Microsoft.Authorization/roleDefinitions/a79a5197-3a5c-4973-a920-486035ffd60f" -> (known after apply)
      ~ scope                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.Dashboard/grafana/dtsse-grafana10-aat" -> (known after apply) # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # azurerm_role_assignment.editors-grafana9[0] must be replaced
-/+ resource "azurerm_role_assignment" "editors-grafana9" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.Dashboard/grafana/dtsse-grafana-aat/providers/Microsoft.Authorization/roleAssignments/7b23e8d2-d7ad-6344-f63c-32b0476c8635" -> (known after apply)
      ~ name                                   = "7b23e8d2-d7ad-6344-f63c-32b0476c8635" -> (known after apply)
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/providers/Microsoft.Authorization/roleDefinitions/a79a5197-3a5c-4973-a920-486035ffd60f" -> (known after apply)
      ~ scope                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.Dashboard/grafana/dtsse-grafana-aat" -> (known after apply) # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # azurerm_role_assignment.more_viewers[0] must be replaced
-/+ resource "azurerm_role_assignment" "more_viewers" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.Dashboard/grafana/dtsse-grafana10-aat/providers/Microsoft.Authorization/roleAssignments/8ef4c91c-eba7-3d17-78f2-433bd13fed00" -> (known after apply)
      ~ name                                   = "8ef4c91c-eba7-3d17-78f2-433bd13fed00" -> (known after apply)
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/providers/Microsoft.Authorization/roleDefinitions/60921a7e-fef1-4a43-9b16-a26c52ad4769" -> (known after apply)
      ~ scope                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.Dashboard/grafana/dtsse-grafana10-aat" -> (known after apply) # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # azurerm_role_assignment.more_viewers-grafana9[0] must be replaced
-/+ resource "azurerm_role_assignment" "more_viewers-grafana9" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.Dashboard/grafana/dtsse-grafana-aat/providers/Microsoft.Authorization/roleAssignments/290aa7bb-9696-697b-809e-f1310f1f1371" -> (known after apply)
      ~ name                                   = "290aa7bb-9696-697b-809e-f1310f1f1371" -> (known after apply)
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/providers/Microsoft.Authorization/roleDefinitions/60921a7e-fef1-4a43-9b16-a26c52ad4769" -> (known after apply)
      ~ scope                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.Dashboard/grafana/dtsse-grafana-aat" -> (known after apply) # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # azurerm_role_assignment.platops[0] must be replaced
-/+ resource "azurerm_role_assignment" "platops" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.Dashboard/grafana/dtsse-grafana10-aat/providers/Microsoft.Authorization/roleAssignments/44376f4c-5e6c-2674-654a-260dc05e35ad" -> (known after apply)
      ~ name                                   = "44376f4c-5e6c-2674-654a-260dc05e35ad" -> (known after apply)
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/providers/Microsoft.Authorization/roleDefinitions/22926164-76b3-42b3-bc55-97df8dab3e41" -> (known after apply)
      ~ scope                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.Dashboard/grafana/dtsse-grafana10-aat" -> (known after apply) # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # azurerm_role_assignment.platops-grafana9[0] must be replaced
-/+ resource "azurerm_role_assignment" "platops-grafana9" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.Dashboard/grafana/dtsse-grafana-aat/providers/Microsoft.Authorization/roleAssignments/3e2bf079-322b-0140-0741-bf2089764e14" -> (known after apply)
      ~ name                                   = "3e2bf079-322b-0140-0741-bf2089764e14" -> (known after apply)
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/providers/Microsoft.Authorization/roleDefinitions/22926164-76b3-42b3-bc55-97df8dab3e41" -> (known after apply)
      ~ scope                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.Dashboard/grafana/dtsse-grafana-aat" -> (known after apply) # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # azurerm_role_assignment.readers[0] must be replaced
-/+ resource "azurerm_role_assignment" "readers" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.Dashboard/grafana/dtsse-grafana10-aat/providers/Microsoft.Authorization/roleAssignments/3912680a-8a0e-9ed8-4740-31e34d8db17e" -> (known after apply)
      ~ name                                   = "3912680a-8a0e-9ed8-4740-31e34d8db17e" -> (known after apply)
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/providers/Microsoft.Authorization/roleDefinitions/60921a7e-fef1-4a43-9b16-a26c52ad4769" -> (known after apply)
      ~ scope                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.Dashboard/grafana/dtsse-grafana10-aat" -> (known after apply) # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # azurerm_role_assignment.readers-grafana9[0] must be replaced
-/+ resource "azurerm_role_assignment" "readers-grafana9" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.Dashboard/grafana/dtsse-grafana-aat/providers/Microsoft.Authorization/roleAssignments/c43bf44b-cf2a-7a8e-3ff9-095bbf4d3235" -> (known after apply)
      ~ name                                   = "c43bf44b-cf2a-7a8e-3ff9-095bbf4d3235" -> (known after apply)
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/providers/Microsoft.Authorization/roleDefinitions/60921a7e-fef1-4a43-9b16-a26c52ad4769" -> (known after apply)
      ~ scope                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.Dashboard/grafana/dtsse-grafana-aat" -> (known after apply) # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # azurerm_role_assignment.viewers[0] must be replaced
-/+ resource "azurerm_role_assignment" "viewers" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.Dashboard/grafana/dtsse-grafana10-aat/providers/Microsoft.Authorization/roleAssignments/14f80a24-fe4e-d256-e32c-717b7f52b0d5" -> (known after apply)
      ~ name                                   = "14f80a24-fe4e-d256-e32c-717b7f52b0d5" -> (known after apply)
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/providers/Microsoft.Authorization/roleDefinitions/60921a7e-fef1-4a43-9b16-a26c52ad4769" -> (known after apply)
      ~ scope                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.Dashboard/grafana/dtsse-grafana10-aat" -> (known after apply) # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # azurerm_role_assignment.viewers-grafana9[0] must be replaced
-/+ resource "azurerm_role_assignment" "viewers-grafana9" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.Dashboard/grafana/dtsse-grafana-aat/providers/Microsoft.Authorization/roleAssignments/63c7d67c-bfda-98ac-ec89-175ff2a5c2ef" -> (known after apply)
      ~ name                                   = "63c7d67c-bfda-98ac-ec89-175ff2a5c2ef" -> (known after apply)
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/providers/Microsoft.Authorization/roleDefinitions/60921a7e-fef1-4a43-9b16-a26c52ad4769" -> (known after apply)
      ~ scope                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.Dashboard/grafana/dtsse-grafana-aat" -> (known after apply) # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.alert-action-group.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.Resources/deployments/DTSSE_Alert"
        name                     = "DTSSE_Alert"
        tags                     = {}
      ~ template_content         = jsonencode(
          ~ {
              ~ outputs        = {
                  ~ actionGroupId = {
                      ~ type  = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                }
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged attributes hidden)
            }
        )
        # (6 unchanged attributes hidden)
    }

  # module.postgresql[0].data.azuread_group.db_admin will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azuread_group" "db_admin" {
      + assignable_to_role             = (known after apply)
      + auto_subscribe_new_members     = (known after apply)
      + behaviors                      = (known after apply)
      + description                    = (known after apply)
      + display_name                   = "DTS Platform Operations"
      + dynamic_membership             = (known after apply)
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_enabled                   = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + provisioning_options           = (known after apply)
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + theme                          = (known after apply)
      + types                          = (known after apply)
      + visibility                     = (known after apply)
      + writeback_enabled              = (known after apply)
    }

  # module.postgresql[0].data.azuread_service_principal.mi_name[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azuread_service_principal" "mi_name" {
      + account_enabled               = (known after apply)
      + alternative_names             = (known after apply)
      + app_role_assignment_required  = (known after apply)
      + app_role_ids                  = (known after apply)
      + app_roles                     = (known after apply)
      + application_id                = (known after apply)
      + application_tenant_id         = (known after apply)
      + client_id                     = (known after apply)
      + description                   = (known after apply)
      + display_name                  = (known after apply)
      + feature_tags                  = (known after apply)
      + features                      = (known after apply)
      + homepage_url                  = (known after apply)
      + id                            = (known after apply)
      + login_url                     = (known after apply)
      + logout_url                    = (known after apply)
      + notes                         = (known after apply)
      + notification_email_addresses  = (known after apply)
      + oauth2_permission_scope_ids   = (known after apply)
      + oauth2_permission_scopes      = (known after apply)
      + object_id                     = "ca6d5085-485a-417d-8480-c3cefa29df31"
      + preferred_single_sign_on_mode = (known after apply)
      + redirect_uris                 = (known after apply)
      + saml_metadata_url             = (known after apply)
      + saml_single_sign_on           = (known after apply)
      + service_principal_names       = (known after apply)
      + sign_in_audience              = (known after apply)
      + tags                          = (known after apply)
      + type                          = (known after apply)
    }

  # module.postgresql[0].data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.postgresql[0].data.azurerm_subnet.pg_subnet[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subnet" "pg_subnet" {
      + address_prefix                                = (known after apply)
      + address_prefixes                              = (known after apply)
      + default_outbound_access_enabled               = (known after apply)
      + id                                            = (known after apply)
      + name                                          = "postgresql"
      + network_security_group_id                     = (known after apply)
      + private_endpoint_network_policies             = (known after apply)
      + private_link_service_network_policies_enabled = (known after apply)
      + resource_group_name                           = "cft-aat-network-rg"
      + route_table_id                                = (known after apply)
      + service_endpoints                             = (known after apply)
      + virtual_network_name                          = "cft-aat-vnet"
    }

  # module.postgresql[0].data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.postgresql[0].azurerm_postgresql_flexible_server.pgsql_server will be updated in-place
  ~ resource "azurerm_postgresql_flexible_server" "pgsql_server" {
        id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-dashboard-flexdb-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/dtsse-dashboard-flexdb-aat"
        name                              = "dtsse-dashboard-flexdb-aat"
        tags                              = {
            "application"         = "core"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/dtsse-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#reform-swe"
            "environment"         = "staging"
            "managedBy"           = "DTS Software Engineering"
        }
        # (20 unchanged attributes hidden)

      ~ authentication {
          ~ tenant_id                     = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.postgresql[0].azurerm_postgresql_flexible_server_firewall_rule.pg_firewall_rules["grafana00"] will be updated in-place
  ~ resource "azurerm_postgresql_flexible_server_firewall_rule" "pg_firewall_rules" {
      ~ end_ip_address   = "52.148.220.236" -> (known after apply)
        id               = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-dashboard-flexdb-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/dtsse-dashboard-flexdb-aat/firewallRules/grafana00"
        name             = "grafana00"
      ~ start_ip_address = "52.148.220.236" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.postgresql[0].azurerm_postgresql_flexible_server_firewall_rule.pg_firewall_rules["grafana01"] will be updated in-place
  ~ resource "azurerm_postgresql_flexible_server_firewall_rule" "pg_firewall_rules" {
      ~ end_ip_address   = "20.61.85.167" -> (known after apply)
        id               = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-dashboard-flexdb-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/dtsse-dashboard-flexdb-aat/firewallRules/grafana01"
        name             = "grafana01"
      ~ start_ip_address = "20.61.85.167" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.postgresql[0].azurerm_postgresql_flexible_server_firewall_rule.pg_firewall_rules["grafana1000"] will be updated in-place
  ~ resource "azurerm_postgresql_flexible_server_firewall_rule" "pg_firewall_rules" {
      ~ end_ip_address   = "51.145.46.198" -> (known after apply)
        id               = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-dashboard-flexdb-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/dtsse-dashboard-flexdb-aat/firewallRules/grafana1000"
        name             = "grafana1000"
      ~ start_ip_address = "51.145.46.198" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.postgresql[0].azurerm_postgresql_flexible_server_firewall_rule.pg_firewall_rules["grafana1001"] will be updated in-place
  ~ resource "azurerm_postgresql_flexible_server_firewall_rule" "pg_firewall_rules" {
      ~ end_ip_address   = "51.143.184.223" -> (known after apply)
        id               = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-dashboard-flexdb-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/dtsse-dashboard-flexdb-aat/firewallRules/grafana1001"
        name             = "grafana1001"
      ~ start_ip_address = "51.143.184.223" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 18 to add, 7 to change, 18 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":200,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->